using System;

namespace HomeWork
{
    class Program
    {
        //static void Main()

        //// 2 Урок

        //{
        //    decimal pi = 3.141592653m;
        //    decimal e = 2.7182818284590452m;

        //    Console.WriteLine(pi);

        //    Console.WriteLine(e);

        //    Console.ReadKey();

        //}

        // .......................3 Урок

        // 2 Задание

        //{
        //    string n = "Моя строка 1";
        //    string t = "Моя стрка 2";
        //    string a = "Моя строка 3";

        //    Console.WriteLine(n);
        //    Console.WriteLine(t);
        //    Console.WriteLine(a);
        //}

        // 3 Задание

        //{
        //    int x = 10;
        //    int y = 12;
        //    int z = 3;
        //    double result = (x + y + z) / 3f;



        //    Console.WriteLine(result);

        //}

        // 4 Задание

        //float r = 12f;
        //float h = 3f;
        //const float pi = 3.141592653f;

        //double volume = pi * r * r * h;
        //double s = 2 * pi * r;

        //Console.WriteLine("Объем цилиндра равен " + volume);
        //Console.WriteLine("Полощадь поверхности цилиндра равна " + s);



        // .......................4 Урок

        // 1 Задание


        //double result = 0;

        //Console.WriteLine("Введите первое число");
        //string a = Console.ReadLine();
        //double operand1 = double.Parse(a);


        //Console.WriteLine("Введите второе число");
        //string b = Console.ReadLine();
        //double operand2 = double.Parse(b);

        //do
        //{
        //    Console.WriteLine("Введите второе число");
        //} while (operand2 >= 0 && operand2 <= 9);

        //switch (b)
        //{
        //    case "1":
        //        {
        //            break;
        //        }
        //    case "2":
        //        {
        //            break;
        //        }
        //    case "3":
        //        {
        //            break;
        //        }
        //    case "4":
        //        {
        //            break;
        //        }
        //    case "5":
        //        {
        //            break;
        //        }
        //    case "6":
        //        {
        //            break;
        //        }
        //    case "7":
        //        {
        //            break;
        //        }
        //    case "8":
        //        {
        //            break;
        //        }
        //    case "9":
        //        {
        //            break;
        //        }
        //    case "0":
        //        {
        //            break;
        //        }
        //    default:
        //        {
        //            Console.WriteLine("Введите число!");
        //            break;
        //        }
        //}



        //Console.WriteLine("Введите знак операции");
        //string sing = Console.ReadLine();

        //switch (sing)
        //{
        //    case "+":
        //        {
        //            result = operand1 + operand2;
        //            break;
        //        }
        //    case "-":
        //        {
        //            result = operand1 - operand2;
        //            break;
        //        }
        //    case "/":
        //        {
        //            if (operand1 == 0 || operand2 == 0)
        //            {
        //                Console.WriteLine("На ноль делить нельзя!");
        //            }
        //            else
        //            {
        //                result = operand1 / operand2;
        //            }

        //            break;
        //        }
        //    case "*":
        //        {
        //            result = operand1 * operand2;
        //            break;
        //        }
        //    default:
        //        {
        //            Console.WriteLine("Вы ввели не знак арифмитической операции!");
        //            break;
        //        }

        //}
        //Console.WriteLine(result);
        //Console.ReadKey();


        // 2 Задание

        //    Console.WriteLine("Введите число");
        //    string a = Console.ReadLine();

        //    int operand1 = int.Parse(a);

        //if (operand1>=0 && operand1<=14)
        //{
        //    Console.WriteLine("Число входит в первый промежуток");
        //} else if (operand1>=15 && operand1<=35)
        //{
        //    Console.WriteLine("Число входит во второй промежуток");
        //} else if (operand1>=36 && operand1<=49)
        //{
        //    Console.WriteLine("Число входит в 3 промежуток");
        //} else if (operand1 == 50)
        //{
        //    Console.WriteLine("Число 50 входит в 3 и в 4 промежуток");
        //} else if (operand1>=51 && operand1<=100)
        //{
        //    Console.WriteLine("Число входит в 4 промежуток");
        //} else if (operand1<0 || operand1>100)
        //{
        //    Console.WriteLine("Число не входит ни в одиз из возможных промежутков!");
        //}
        //Console.ReadKey();



        // .............................................................5 Урок

        //  1 Задание

        //Console.WriteLine("Enter number");
        //string operand = Console.ReadLine();
        //double number = double.Parse(operand);

        //if (number == 0)
        //{
        //    Console.WriteLine("Enter another number ");
        //}

        //else if (number % 2 == 0)
        //{
        //    Console.WriteLine("Its even number!");
        //}
        //else Console.WriteLine("Its odd number!");


        //Console.ReadKey();


        // 2 Задание

        //int salary = 500;
        //Console.WriteLine("Enter duration of work experience");
        //string a = Console.ReadLine();
        //double years = double.Parse(a);

        //if (years < 5)
        //{ Console.WriteLine($"Премия составляет 10% от заработной платы и равна {salary * 10 / 100} "); };

        //if (years > 5 && years <=10)
        //{ Console.WriteLine($"Премия составляет 15% от заработной платы и равна {salary * 15 / 100} "); }

        //if (years >10 && years <=15)
        //{ Console.WriteLine($"Премия составляет 25% от заработной платы и равна {salary * 25 / 100} "); }

        //if (years > 15 && years <= 20)
        //{ Console.WriteLine($"Премия составляет 35% от заработной платы и равна {salary * 35 / 100} "); }

        //if (years > 20 && years <= 25)
        //{ Console.WriteLine($"Премия составляет 45% от заработной платы и равна {salary * 45 / 100} "); }

        //if (years > 25)
        //{ Console.WriteLine($"Премия составляет 50% от заработной платы и равна {salary * 50 / 100} "); }

        //Console.ReadKey();



        // .............................................................6 Урок

        // 1 Задание

        //            Используя Visual Studio, создайте проект по шаблону Console Application.  
        //Дано два числа A и B(A<B) выведите суму всех чисел расположенных между данными числами на экран. 
        //Дано два числа A и B(A<B) выведите все нечетные значения, расположенные между данными числами.


        //Console.WriteLine("Ведите первое число: ");
        //string operand1 = Console.ReadLine();
        //int a = int.Parse(operand1);

        //Console.WriteLine("Ведите второе число: ");
        //string operand2 = Console.ReadLine();
        //int b = int.Parse(operand2);

        //int counter = a + 1;
        //int summ = 0;

        //if (a < b)
        //{
        //    while (counter > a && counter < b)
        //    {
        //        summ += counter;
        //        counter++;
        //    }
        //    Console.WriteLine(summ);
        //} else
        //    Console.WriteLine("Первое число должно быть меньше второго!");
        //Console.ReadKey();




        //Console.WriteLine("Ведите первое число: ");
        // string operand1 = Console.ReadLine();
        // int a = int.Parse(operand1);

        // Console.WriteLine("Ведите второе число: ");
        // string operand2 = Console.ReadLine();
        // int b = int.Parse(operand2);

        // int counter = a;


        // if (a < b)
        // {
        //     while (counter >= a && counter < b)
        //     {
        //         counter++;
        //         if (counter %2 != 0 && counter < b && counter > a)
        //             Console.Write(counter + " ");
        //     }

        // }
        // else
        //     Console.WriteLine("Первое число должно быть меньше второго!");
        // Console.ReadKey();


        // 2 Задание

        //            Используя Visual Studio 2010, создайте проект по шаблону Console Application.  
        //Используя циклы и метод: 
        //Console.Write("*"), Console.Write(" "), Console.Write("\n")(для перехода на новую строку).


        //Выведите на экран:
        //· прямоугольник
        //· прямоугольный треугольник  
        //· равносторонний треугольник   
        //· ромб


        // ПРЯМОУГОЛЬНИК

        // for (int counter = 0; counter < 6; counter++)
        //{
        //    Console.Write("*");
        //}
        //Console.WriteLine();
        // for (int counter2 = 0; counter2 < 6; counter2++)
        //{
        //    Console.Write("*");
        //}
        //Console.WriteLine();
        //for (int counter3 = 0; counter3 < 6; counter3++)
        //{
        //    Console.Write("*");
        //}

        // ПРЯМОУГОЛЬНЫЙ ТРЕУГОЛЬНИК

        //for (int counter = 0; counter < 1; counter++)
        //{
        //    Console.Write("*");
        //}
        //Console.WriteLine();
        //for (int counter2 = 0; counter2 < 4; counter2++)
        //{
        //    Console.Write("*");
        //}
        //Console.WriteLine();
        //for (int counter3 = 0; counter3 < 8; counter3++)
        //{
        //    Console.Write("*");
        //}
        //Console.WriteLine();
        //for (int counter4 = 0; counter4 < 12; counter4++)
        //{
        //    Console.Write("*");
        //}
        //Console.WriteLine();
        //for (int counter5 = 0; counter5 < 16; counter5++)
        //{
        //    Console.Write("*");
        //}


        // РАВНОСТОРОННИЙ ТРЕУГОЛЬНИК

        //for (int counter = 0; counter < 1; counter++)
        //{
        //    Console.Write("*");
        //}
        //Console.WriteLine();
        //for (int counter2 = 0; counter2 < 2; counter2++)
        //{
        //    Console.Write("*");
        //}
        //Console.WriteLine();
        //for (int counter3 = 0; counter3 < 4; counter3++)
        //{
        //    Console.Write("*");
        //}

        //    РОМБ


        //for (int counter = 0; counter < 4; counter++)
        //{
        //    if (counter < 3)
        //    {
        //        Console.Write(" ");
        //    } 
        //    if (counter == 3)
        //    {
        //        Console.Write("*");
        //    }

        //}
        //Console.WriteLine();

        //for (int counter = 0; counter < 5; counter++)
        //{
        //    if (counter < 2)
        //    {
        //        Console.Write(" ");
        //    }
        //    if (counter >= 2 && counter <= 4)
        //    {
        //        Console.Write("*");
        //    }

        //}
        //Console.WriteLine();

        //for (int counter = 0; counter < 7; counter++)
        //{
        //    if (counter < 1)
        //    {
        //        Console.Write(" ");
        //    }
        //    if (counter >= 2 && counter <= 6)
        //    {
        //        Console.Write("*");
        //    }

        //}
        //Console.WriteLine();

        //for (int counter = 0; counter < 9; counter++)
        //{
        //    if (counter < 0)
        //    {
        //        Console.Write(" ");
        //    }
        //    if (counter >= 2 && counter <= 8)
        //    {
        //        Console.Write("*");
        //    }

        //}
        //Console.WriteLine();

        //for (int counter = 0; counter < 7; counter++)
        //{
        //    if (counter < 1)
        //    {
        //        Console.Write(" ");
        //    }
        //    if (counter >= 2 && counter <= 6)
        //    {
        //        Console.Write("*");
        //    }

        //}
        //Console.WriteLine();

        //for (int counter = 0; counter < 5; counter++)
        //{
        //    if (counter < 2)
        //    {
        //        Console.Write(" ");
        //    }
        //    if (counter >= 2 && counter <= 4)
        //    {
        //        Console.Write("*");
        //    }

        //}
        //Console.WriteLine();

        //for (int counter = 0; counter < 4; counter++)
        //{
        //    if (counter < 3)
        //    {
        //        Console.Write(" ");
        //    }
        //    if (counter == 3)
        //    {
        //        Console.Write("*");
        //    }

        //}
        //Console.WriteLine();            

        //Console.ReadKey ();


        // задание 3

        //            Имеется N клиентов, которым компания производитель должна доставить товар. Сколько существует возможных маршрутов доставки товара, с учетом того, что товар будет доставлять одна машина?
        //Используя Visual Studio, создайте проект по шаблону Console Application.
        //Напишите программу, которая будет рассчитывать, и выводить на экран количество возможных вариантов доставки товара. Для решения задачи, используйте факториал N!, рассчитываемый с помощью цикла do -while.

        //Console.WriteLine("Введите число клиентов доставки: ");
        //string a = Console.ReadLine();
        //int clients = int.Parse(a);
        //int factorial = 1;

        //do
        //{
        //    factorial *= clients--;
        //}
        //while (clients > 0);

        //Console.WriteLine(factorial + " вариантов доставки товара");          


        //}

        // .............................................................7 Урок

        // Задание 1
        //Создайте метод с именем Calculate, который принимает в качестве параметров три целочисленных аргумента и выводит на экран 
        //среднее арифметическое значений аргументов.

        //static double Calculate(double a, double b, double c)
        //{
        //    double result = 0;
        //    result = (a + b + c) / 3;
        //    return result;
        //}

        //static void Main()
        //{
        //    Console.WriteLine("Введите первое число: ");
        //    string first = Console.ReadLine();
        //    double a = double.Parse(first);

        //    Console.WriteLine("Введите второе число: ");
        //    string second = Console.ReadLine();
        //    double b = double.Parse(second);

        //    Console.WriteLine("Введите третье число: ");
        //    string third = Console.ReadLine();
        //    double c = double.Parse(third);

        //    double result = Calculate(a, b, c);
        //    Console.WriteLine("Среднее арифметическое равно " + result);
        //    Console.ReadKey();
        //}

        // Задание 2
        //        Создайте четыре метода для выполнения арифметических операций, с именами: Add – сложение, Sub – вычитание, Mul – умножение, Div – деление.Каждый метод должен принимать два целочисленных аргумента и выводить на экран результат выполнения арифметической операции соответствующей имени метода.Метод деления Div, должен выполнять проверку попытки деления на ноль.
        //Требуется предоставить пользователю возможность вводить с клавиатуры значения операндов и знак арифметической операции, для выполнения вычислений.

        //static double Add(double a, double b)
        //{
        //    double result = 0;
        //    result = a + b;
        //    return result;
        //}

        //static double Sub(double a, double b)
        //{
        //    double result = 0;
        //    result = a - b;
        //    return result;
        //}

        //static double Mul(double a, double b)
        //{
        //    double result = 0;
        //    result = a * b;
        //    return result;
        //}

        //static double Div(double a, double b)
        //{
        //    double result = 0;

        //    if (b == 0)
        //    {
        //        Console.WriteLine("На ноль делить нельзя!!!");
        //    } else
        //        result = a / b;

        //    return result;
        //}

        //static void Main()
        //{
        //    Console.WriteLine("Введите первое число: ");
        //    string first = Console.ReadLine();
        //    double operand1 = double.Parse(first);

        //    Console.WriteLine("Введите второе число: ");
        //    string second = Console.ReadLine();
        //    double operand2 = double.Parse(second);

        //    Console.WriteLine("Введите знак арифметической операции: ");
        //    string sing = Console.ReadLine();

        //    double result = 0;
        //        switch (sing)
        //        {
        //            case "+":
        //                result = Add(operand1, operand2);
        //                Console.WriteLine("Результат равен " + result);
        //                break;
        //            case "-":
        //                result = Sub(operand1, operand2);
        //                Console.WriteLine("Результат равен " + result);
        //                break;
        //            case "*":
        //                result = Mul(operand1, operand2);
        //                Console.WriteLine("Результат равен " + result);
        //                break;
        //            case "/":
        //            if (operand2 == 0)
        //            {
        //                Console.WriteLine("На ноль делить нельзя!!!");
        //            } else
        //            {
        //                result = Div(operand1, operand2);
        //                Console.WriteLine("Результат равен " + result);
        //            }
        //                break;
        //        }
        //    Console.ReadKey();
        //}    

        //3 Задание
        //        Напишите программу, которая будет выполнять конвертирование валют.
        //Пользователь вводит: 
        //сумму денег в определенной валюте.
        //курс для конвертации в другую валюту. 
        //Организуйте вывод результата операции конвертирования валюты на экран. 

        //static double Convertation(double a, double b)
        //{
        //    double result = 0;
        //    result = a * b;
        //    return result;
        //}

        //static void Main()
        //{
        //    Console.WriteLine("Введите сумму денег в валюте: ");
        //    string a = Console.ReadLine();
        //    double sum = double.Parse(a);

        //    Console.WriteLine("Введите название валюты: ");
        //    string name = Console.ReadLine();

        //    Console.WriteLine("Введите курс для конвертации в другую валюту: ");
        //    string b = Console.ReadLine();
        //    double course = double.Parse(b);

        //    double result = 0;
        //    result = Convertation(sum, course);
        //    Console.WriteLine("Результат операции конвертирования валюты равен : " + result +" "+ name);
        //    Console.ReadKey();

        //}

        // 4 задание 
        //        Напишите метод, который будет определять:  
        //1) является ли введенное число положительным или отрицательным.
        //2) Является ли оно простым(используйте технику перебора значений).  
        //(Простое число — это натуральное число, которое делится на 1 и само на себя.Чтобы определить простое число или нет, следует найти все его целые делители. Если делителей больше 2-х, значит оно не простое.)
        //3) Делится ли на 2, 5, 3, 6, 9 без остатка.

        //static string PositiveNegative(double a)
        //{
        //    if (a > 0)
        //    {
        //        return "Число является положительным";
        //    }
        //    else if (a < 0)
        //    {
        //        return "Число является отридцательным";
        //    }
        //    return "Число равно 0";
        //}

        //static string Div(double number)
        //{
        //    if (number % 2 == 0 || number % 3 == 0 || number % 5 == 0 || number % 6 == 0 || number % 9 == 0)
        //    {
        //        return "Число делится на 2, 3, 5, 6, 9";
        //    }
        //    else
        //        return "Число не делится на 2, 3, 5, 6, 9";
        //}

        //static string SimpleDifficult (double number)
        //{
        //    if (number < 2) return "Простые числа начинаются с числа 2, ваше число меньше числа 2!";
        //    for (int i = 2; i <= Math.Sqrt(number); i++)
        //    {
        //        if (number % i == 0) return "Число сложное";
        //    }
        //    return "Число простое";
        //}
        //static void Main ()
        //    {
        //        Console.WriteLine("Введите число: ");
        //        string input = Console.ReadLine();
        //        double number = double.Parse(input);

        //        string result;
        //        result = PositiveNegative(number);
        //        Console.WriteLine(result);
        //        result = Div(number);
        //        Console.WriteLine(result);

        //    result = SimpleDifficult(number);
        //    Console.WriteLine(result);


        //    }

        // .............................................................8 Урок

        // Задание 1 

        //Создайте метод с именем Calculate, который принимает в качестве параметров три целочисленных значения и возвращает значение
        //каждого аргумента деленного на 5.

        //static double Calculate(int a, int b, int c)
        //{
        //    double result1 = (double)(a);
        //    double result2 = (double)(b);
        //    double result3 = (double)(c);

        //    double operand1 = 0;
        //    double operand2 = 0;
        //    double operand3 = 0;

        //    operand1 = result1 / 5;
        //    operand2 = result2 / 5;
        //    operand3 = result3 / 5;

        //    double final = operand1 + operand2 + operand3;
        //    return final;
        //}

        //static void Main()
        //{
        //    Console.WriteLine("Введите 3 целочисленных значения: ");

        //    string a = Console.ReadLine();
        //    int operand1 = int.Parse(a);

        //    string b = Console.ReadLine();
        //    int operand2 = int.Parse(b);

        //    string c = Console.ReadLine();
        //    int operand3 = int.Parse(c);

        //    double result = 0;

        //    result = Calculate(operand1, operand2, operand3);

        //    Console.WriteLine(result);

        //    Console.ReadKey();

        //}

        //  Задание 2

        // Представьте, что вы реализуете программу для банка, которая помогает определить, погасил ли клиент кредит или нет. Допустим,
        // ежемесячная сумма платежа должна составлять 100 грн. Клиент должен выполнить 7 платежей, но может платить реже большими суммами.
        // Т.е., может двумя платежами по 300 и 400 грн. Закрыть весь долг.Создайте метод, который будет в качестве аргумента принимать
        // сумму платежа, введенную экономистом банка.Метод выводит на экран информацию о состоянии кредита(сумма задолженности, сумма
        // переплаты, сообщение об отсутствии долга).  

        //static string InfoCredit(double payment, double paymentNumber)
        //{
        //    const double creditSumm = 700;
        //    var message = string.Empty;
        //    if (paymentNumber <= 7)
        //    {
        //         if (payment >= 100 && payment < creditSumm)
        //                {
        //                    message = ("Сумма задолжности равна: " + (creditSumm - payment));
        //                } else if (payment == creditSumm)
        //                {
        //                    message = ("Кредит погашен и долг отсутствует!");
        //                } else if (payment >= creditSumm)
        //                {
        //                    message = ("Кредит погашен и сумма переплаты равна :" + (payment - creditSumm));
        //                } else if (payment < 100)
        //        {
        //            Console.WriteLine("Минимальный платеж в месяц составляет 100 у.е.");
        //        }
        //    } else 
        //    {
        //        message = ("Срок выплаты кредита истек");
        //        Console.WriteLine("Сумма задолжности равна: " + (creditSumm - payment));
        //    }
        //    return message;
        //}

        //static void Main()
        //{
        //    bool isNumber = true;
        //    double payment = 0;
        //    double paymentNumber = 0;
        //    do
        //    {
        //        Console.WriteLine("Введите сумму платежа: ");
        //        string a = Console.ReadLine();
        //        isNumber = double.TryParse(a, out double number);
        //        if (isNumber)
        //        {
        //            payment = number;
        //        }
        //        else
        //        {
        //            Console.WriteLine("не удалось распознать число, попробуйте еще раз");
        //        }
        //    } while (!isNumber);

        //    do
        //    {
        //        Console.WriteLine("Введите порядковый номер платежа: ");
        //        string a = Console.ReadLine();
        //        isNumber = double.TryParse(a, out double number);
        //        if (isNumber)
        //        {
        //            paymentNumber = number;
        //        }
        //        else
        //        {
        //            Console.WriteLine("не удалось распознать число, попробуйте еще раз");
        //        }
        //    } while (!isNumber);

        //    string result = InfoCredit(payment, paymentNumber);
            
        //    Console.WriteLine(result);

        //    Console.ReadKey();
        //}

        
    }
}

